testFiles/results_one_thread_6GB_bench/memtier_oomd_no_freeze.out
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  40 secs]  0 threads:       37954 ops,     840 (avg:     947) ops/sec, 439.97MB/sec (avg: 689.79MB/sec), 525.33 (avg: 527.87) msec latency

1         Threads
50        Connections per thread
40        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets           86.09          ---          ---       551.16970       552.95900       679.93500       724.99100    705288.41 
Gets          858.72         0.00       858.72       525.54406       573.43900       716.79900       831.48700        33.47 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals        944.82         0.00       858.72       527.87679       569.34300       712.70300       827.39100    705321.87 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET      68.607        0.000
SET     485.375        5.000
SET     499.711       10.000
SET     507.903       15.000
SET     516.095       20.000
SET     522.239       25.000
SET     528.383       30.000
SET     536.575       35.000
SET     540.671       40.000
SET     544.767       45.000
SET     552.959       50.000
SET     552.959       52.500
SET     557.055       55.000
SET     561.151       57.500
SET     561.151       60.000
SET     565.247       62.500
SET     569.343       65.000
SET     573.439       67.500
SET     573.439       70.000
SET     577.535       72.500
SET     581.631       75.000
SET     585.727       76.250
SET     585.727       77.500
SET     589.823       78.750
SET     593.919       80.000
SET     593.919       81.250
SET     598.015       82.500
SET     602.111       83.750
SET     606.207       85.000
SET     610.303       86.250
SET     614.399       87.500
SET     614.399       88.125
SET     618.495       88.750
SET     618.495       89.375
SET     622.591       90.000
SET     622.591       90.625
SET     626.687       91.250
SET     630.783       91.875
SET     630.783       92.500
SET     634.879       93.125
SET     638.975       93.750
SET     638.975       94.062
SET     638.975       94.375
SET     643.071       94.688
SET     643.071       95.000
SET     647.167       95.312
SET     647.167       95.625
SET     651.263       95.938
SET     651.263       96.250
SET     655.359       96.562
SET     655.359       96.875
SET     655.359       97.031
SET     655.359       97.188
SET     659.455       97.344
SET     659.455       97.500
SET     659.455       97.656
SET     663.551       97.812
SET     663.551       97.969
SET     663.551       98.125
SET     667.647       98.281
SET     667.647       98.438
SET     671.743       98.516
SET     671.743       98.594
SET     671.743       98.672
SET     675.839       98.750
SET     675.839       98.828
SET     679.935       98.906
SET     679.935       98.984
SET     679.935       99.062
SET     684.031       99.141
SET     684.031       99.219
SET     688.127       99.258
SET     688.127       99.297
SET     688.127       99.336
SET     688.127       99.375
SET     688.127       99.414
SET     692.223       99.453
SET     692.223       99.492
SET     696.319       99.531
SET     696.319       99.570
SET     700.415       99.609
SET     700.415       99.629
SET     700.415       99.648
SET     700.415       99.668
SET     704.511       99.688
SET     704.511       99.707
SET     704.511       99.727
SET     704.511       99.746
SET     704.511       99.766
SET     708.607       99.785
SET     708.607       99.805
SET     708.607       99.814
SET     708.607       99.824
SET     716.799       99.834
SET     716.799       99.844
SET     716.799       99.854
SET     716.799       99.863
SET     716.799       99.873
SET     716.799       99.883
SET     724.991       99.893
SET     724.991       99.902
SET     724.991       99.907
SET     724.991       99.912
SET     737.279       99.917
SET     737.279       99.922
SET     737.279       99.927
SET     737.279       99.932
SET     737.279       99.937
SET     737.279       99.941
SET     745.471       99.946
SET     745.471       99.951
SET     745.471       99.954
SET     745.471       99.956
SET     745.471       99.958
SET     745.471       99.961
SET     745.471       99.963
SET     745.471       99.966
SET     745.471       99.968
SET     745.471       99.971
SET     802.815       99.973
SET     802.815      100.000
---
GET       1.151        0.000
GET      61.951        5.000
GET     169.983       10.000
GET     495.615       15.000
GET     516.095       20.000
GET     528.383       25.000
GET     540.671       30.000
GET     548.863       35.000
GET     557.055       40.000
GET     565.247       45.000
GET     573.439       50.000
GET     577.535       52.500
GET     577.535       55.000
GET     581.631       57.500
GET     585.727       60.000
GET     589.823       62.500
GET     593.919       65.000
GET     598.015       67.500
GET     602.111       70.000
GET     606.207       72.500
GET     610.303       75.000
GET     614.399       76.250
GET     614.399       77.500
GET     618.495       78.750
GET     622.591       80.000
GET     622.591       81.250
GET     626.687       82.500
GET     630.783       83.750
GET     634.879       85.000
GET     634.879       86.250
GET     638.975       87.500
GET     643.071       88.125
GET     643.071       88.750
GET     647.167       89.375
GET     647.167       90.000
GET     651.263       90.625
GET     651.263       91.250
GET     655.359       91.875
GET     655.359       92.500
GET     659.455       93.125
GET     663.551       93.750
GET     663.551       94.062
GET     663.551       94.375
GET     663.551       94.688
GET     667.647       95.000
GET     667.647       95.312
GET     667.647       95.625
GET     671.743       95.938
GET     671.743       96.250
GET     675.839       96.562
GET     679.935       96.875
GET     679.935       97.031
GET     679.935       97.188
GET     684.031       97.344
GET     684.031       97.500
GET     688.127       97.656
GET     688.127       97.812
GET     688.127       97.969
GET     692.223       98.125
GET     696.319       98.281
GET     696.319       98.438
GET     700.415       98.516
GET     700.415       98.594
GET     704.511       98.672
GET     704.511       98.750
GET     708.607       98.828
GET     712.703       98.906
GET     716.799       98.984
GET     716.799       99.062
GET     724.991       99.141
GET     733.183       99.219
GET     737.279       99.258
GET     745.471       99.297
GET     745.471       99.336
GET     761.855       99.375
GET     770.047       99.414
GET     778.239       99.453
GET     786.431       99.492
GET     794.623       99.531
GET     794.623       99.570
GET     798.719       99.609
GET     798.719       99.629
GET     802.815       99.648
GET     802.815       99.668
GET     802.815       99.688
GET     802.815       99.707
GET     806.911       99.727
GET     811.007       99.746
GET     811.007       99.766
GET     811.007       99.785
GET     815.103       99.805
GET     815.103       99.814
GET     819.199       99.824
GET     819.199       99.834
GET     823.295       99.844
GET     823.295       99.854
GET     823.295       99.863
GET     827.391       99.873
GET     827.391       99.883
GET     827.391       99.893
GET     831.487       99.902
GET     831.487       99.907
GET     831.487       99.912
GET     831.487       99.917
GET     835.583       99.922
GET     835.583       99.927
GET     835.583       99.932
GET     835.583       99.937
GET     835.583       99.941
GET     835.583       99.946
GET     839.679       99.951
GET     839.679       99.954
GET     839.679       99.956
GET     839.679       99.958
GET     839.679       99.961
GET     839.679       99.963
GET     839.679       99.966
GET     839.679       99.968
GET     839.679       99.971
GET     839.679       99.973
GET     843.775       99.976
GET     843.775      100.000
---
WAIT      0.000      100.000